# tree.db (using execute function in sqlite3)

In [1]:
import sqlite3
c = sqlite3.connect("trees.db")

def query(sql):
    return list(c.execute(sql))

In [2]:
#q1
query("select * from species")

[('m', 'maple'), ('p', 'pine')]

In [3]:
#q2
query("SELECT x, y FROM trees WHERE tree = 'C'")

[(30, 4)]

In [4]:
#q3
query("SELECT tree FROM trees")

[('A',), ('B',), ('C',), ('D',), ('E',)]

In [5]:
#q4
query("SELECT species FROM trees ORDER BY priority DESC")

[('m',), ('m',), ('m',), ('p',), ('p',)]

In [6]:
#q5
query("SELECT tree, priority FROM trees " +
      "ORDER BY priority DESC LIMIT 1")[0]

('B', 100)

In [7]:
#q6
query("""SELECT COUNT(SPECIES) AS c1,
                COUNT(DISTINCT SPECIES) as C2
         FROM trees""")

[(5, 2)]

In [8]:
#q7
query("""SELECT species, COUNT(SPECIES) AS count,
                AVG(diameter) AS size
         FROM trees
         GROUP BY species ORDER BY count DESC""")

[('m', 3, 10.0), ('p', 2, 7.0)]

# fire.db (using read_sql function in Pandas)

In [9]:
import sqlite3
import pandas as pd

c = sqlite3.connect("fire.db")

def query(sql):
    return pd.read_sql(sql, c)

In [10]:
#q8
query("SELECT color, year FROM hydrants WHERE color = 'blue' ")

  color  year
0  blue  2010
1  blue  2014
2  blue  2018

In [11]:
#q9
df = query("SELECT color, year FROM hydrants")
df[df.color == "blue"]

  color  year
3  blue  2010
4  blue  2014
5  blue  2018

In [12]:
#q10
query("SELECT idx FROM hydrants WHERE owner='private' AND active")

   idx
0    3

In [13]:
#q11
df = query("SELECT year, style, active FROM hydrants")
df[df.active == 1]["style"]

2    Pacer
3    Pacer
4    Pacer
5    Pacer
Name: style, dtype: object

In [15]:
#q12
query("SELECT color, COUNT(*) FROM hydrants GROUP BY color")

   color  COUNT(*)
0   blue         3
1  green         1
2    red         2

In [18]:
#q13
query("""SELECT color, COUNT(*) FROM hydrants
         WHERE active GROUP BY color""")

   color  COUNT(*)
0   blue         3
1  green         1

In [20]:
#q14
query("""SELECT color, COUNT(*) AS count FROM hydrants
         GROUP BY color HAVING count > 1""")

  color  count
0  blue      3
1   red      2

In [26]:
#q15
query("""SELECT color, COUNT(*) AS count
         FROM hydrants WHERE year >= 2000
         GROUP BY color HAVING count < 2""")

   color  count
0  green      1
1    red      1